devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
/*=========================================================================*//**
@file    clk.c

@author  Daniel Zorychta

@brief   File support system clock (PLL).

@note    Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32h7/clk_cfg.h"
#include "stm32h7/stm32h7xx.h"
#include "stm32h7/lib/stm32h7xx_ll_rcc.h"
#include "../clk_ioctl.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define TIMEOUT_MS                      250
#define LSE_TIMEOUT_MS                  5000

#define PWR_REGULATOR_VOLTAGE_SCALE0    (0)
#define PWR_REGULATOR_VOLTAGE_SCALE1    ((1*PWR_D3CR_VOS_1) | (1*PWR_D3CR_VOS_0))
#define PWR_REGULATOR_VOLTAGE_SCALE2    ((1*PWR_D3CR_VOS_1) | (0*PWR_D3CR_VOS_0))
#define PWR_REGULATOR_VOLTAGE_SCALE3    ((0*PWR_D3CR_VOS_1) | (1*PWR_D3CR_VOS_0))

#define FLASH_ACR_WRHIGHFREQ_MSK        (FLASH_ACR_WRHIGHFREQ_1 | FLASH_ACR_WRHIGHFREQ_0)
#define FLASH_ACR_WRHIGHFREQ_00         ((0*FLASH_ACR_WRHIGHFREQ_1) | (0*FLASH_ACR_WRHIGHFREQ_0))
#define FLASH_ACR_WRHIGHFREQ_01         ((0*FLASH_ACR_WRHIGHFREQ_1) | (1*FLASH_ACR_WRHIGHFREQ_0))
#define FLASH_ACR_WRHIGHFREQ_10         ((1*FLASH_ACR_WRHIGHFREQ_1) | (0*FLASH_ACR_WRHIGHFREQ_0))

/*==============================================================================
  Local types, enums definitions
==============================================================================*/

/*==============================================================================
  Local function prototypes
==============================================================================*/
static u32_t get_pll_input_freq(void);
static void  get_pll_input_parameters(u32_t *pll_input_freq, u32_t *pll_input_range, u32_t *pll_ouput_range);
static int   configure_core_voltage_and_flash_latency(void);

/*==============================================================================
  Local object definitions
==============================================================================*/

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(CLK, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG4(device_handle, major, minor, config);

        int err = ESUCC;

        LL_RCC_DeInit();

        //----------------------------------------------------------------------
        // LSI OSCILLATOR
        //----------------------------------------------------------------------
        if (__CLK_LSI_ON__) {
                LL_RCC_LSI_Enable();

                clock_t tref = sys_get_uptime_ms();
                while (not sys_is_time_expired(tref, TIMEOUT_MS)) {
                        if (LL_RCC_LSI_IsReady()) {
                                break;
                        }
                }

                if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: LSI timeout");
                }
        }

        //----------------------------------------------------------------------
        // LSE OSCILLATOR
        //----------------------------------------------------------------------
        if (__CLK_LSE_ON__) {

                SET_BIT(PWR->CR1, PWR_CR1_DBP);

                if (!(RCC->BDCR & RCC_BDCR_LSERDY)) {

                        if (__CLK_LSE_ON__ == _CLK_BAYPASS) {
                                LL_RCC_LSE_EnableBypass();

                        } else {
                                LL_RCC_LSE_Enable();

                                clock_t tref = sys_get_uptime_ms();
                                while (not sys_is_time_expired(tref, TIMEOUT_MS)) {
                                        if (LL_RCC_LSE_IsReady()) {
                                                break;
                                        }
                                }

                                if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                        printk("CLK: LSE timeout");
                                }
                        }
                }
        }

        //----------------------------------------------------------------------
        // HSE OSCILLATOR
        //----------------------------------------------------------------------
        if (__CLK_HSE_ON__) {

                if (__CLK_HSE_ON__ == _CLK_BAYPASS) {
                        LL_RCC_HSE_Enable();
                        LL_RCC_HSE_EnableBypass();

                } else {
                        LL_RCC_HSE_Enable();

                        clock_t tref = sys_get_uptime_ms();
                        while (not sys_is_time_expired(tref, TIMEOUT_MS)) {
                                if (LL_RCC_HSE_IsReady()) {
                                        break;
                                }
                        }

