devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
                        if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                printk("CLK: HSE timeout");
                        }
                }
        }

        //----------------------------------------------------------------------
        // Core voltage regulator setup and FLASH latency
        //----------------------------------------------------------------------
        err = configure_core_voltage_and_flash_latency();
        if (err) {
                goto finish;
        }

        //----------------------------------------------------------------------
        // Setup PLLs clock source
        //----------------------------------------------------------------------
        LL_RCC_PLL_SetSource(__CLK_PLL_SRC__);
        u32_t pllinputfreq = 0;
        u32_t pll_input_range;
        u32_t pll_ouput_range;
        get_pll_input_parameters(&pllinputfreq, &pll_input_range, &pll_ouput_range);

        //----------------------------------------------------------------------
        // PLL1
        //----------------------------------------------------------------------
        if (__CLK_PLL1_ON__) {
                (__CLK_PLL1_P_ENABLE__ == _YES_) ? LL_RCC_PLL1P_Enable() : LL_RCC_PLL1P_Disable();
                (__CLK_PLL1_Q_ENABLE__ == _YES_) ? LL_RCC_PLL1Q_Enable() : LL_RCC_PLL1Q_Disable();
                (__CLK_PLL1_R_ENABLE__ == _YES_) ? LL_RCC_PLL1R_Enable() : LL_RCC_PLL1R_Disable();

                LL_RCC_PLL1_SetP(__CLK_PLL1_P__);
                LL_RCC_PLL1_SetQ(__CLK_PLL1_Q__);
                LL_RCC_PLL1_SetR(__CLK_PLL1_R__);
                LL_RCC_PLL1_SetM(__CLK_PLL1_M__);
                LL_RCC_PLL1_SetN(__CLK_PLL1_N__);
                LL_RCC_PLL1_SetVCOOutputRange(pll_ouput_range);
                LL_RCC_PLL1_SetVCOInputRange(pll_input_range);
                LL_RCC_PLL1_Enable();

                clock_t tref = sys_get_uptime_ms();
                while (not LL_RCC_PLL1_IsReady()) {
                        if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                printk("CLK: PLL1 timeout");
                                break;
                        }

                        sys_sleep_ms(1);
                }
        }

        //----------------------------------------------------------------------
        // PLL2
        //----------------------------------------------------------------------
        if (__CLK_PLL2_ON__) {
                (__CLK_PLL2_P_ENABLE__ == _YES_) ? LL_RCC_PLL2P_Enable() : LL_RCC_PLL2P_Disable();
                (__CLK_PLL2_Q_ENABLE__ == _YES_) ? LL_RCC_PLL2Q_Enable() : LL_RCC_PLL2Q_Disable();
                (__CLK_PLL2_R_ENABLE__ == _YES_) ? LL_RCC_PLL2R_Enable() : LL_RCC_PLL2R_Disable();

                LL_RCC_PLL2_SetP(__CLK_PLL2_P__);
                LL_RCC_PLL2_SetQ(__CLK_PLL2_Q__);
                LL_RCC_PLL2_SetR(__CLK_PLL2_R__);
                LL_RCC_PLL2_SetM(__CLK_PLL2_M__);
                LL_RCC_PLL2_SetN(__CLK_PLL2_N__);
                LL_RCC_PLL2_SetVCOOutputRange(pll_ouput_range);
                LL_RCC_PLL2_SetVCOInputRange(pll_input_range);
                LL_RCC_PLL2_Enable();

                clock_t tref = sys_get_uptime_ms();
                while (not LL_RCC_PLL2_IsReady()) {
                        if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                printk("CLK: PLL2 timeout");
                                break;
                        }

                        sys_sleep_ms(1);
                }
        }

        //----------------------------------------------------------------------
        // PLL3
        //----------------------------------------------------------------------
        if (__CLK_PLL3_ON__) {
                (__CLK_PLL3_P_ENABLE__ == _YES_) ? LL_RCC_PLL3P_Enable() : LL_RCC_PLL3P_Disable();
                (__CLK_PLL3_Q_ENABLE__ == _YES_) ? LL_RCC_PLL3Q_Enable() : LL_RCC_PLL3Q_Disable();
                (__CLK_PLL3_R_ENABLE__ == _YES_) ? LL_RCC_PLL3R_Enable() : LL_RCC_PLL3R_Disable();

                LL_RCC_PLL3_SetP(__CLK_PLL3_P__);
                LL_RCC_PLL3_SetQ(__CLK_PLL3_Q__);
                LL_RCC_PLL3_SetR(__CLK_PLL3_R__);
                LL_RCC_PLL3_SetM(__CLK_PLL3_M__);
                LL_RCC_PLL3_SetN(__CLK_PLL3_N__);
                LL_RCC_PLL3_SetVCOOutputRange(pll_ouput_range);
                LL_RCC_PLL3_SetVCOInputRange(pll_input_range);
                LL_RCC_PLL3_Enable();

                clock_t tref = sys_get_uptime_ms();
                while (not LL_RCC_PLL3_IsReady()) {
                        if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                printk("CLK: PLL3 timeout");
                                break;
                        }

                        sys_sleep_ms(1);
                }
        }

        //----------------------------------------------------------------------
        // Clock prescalers
        //----------------------------------------------------------------------
        LL_RCC_SetSysPrescaler(__CLK_SYSCLK_DIV__);
        LL_RCC_SetAHBPrescaler(__CLK_AHB_DIV__);
        LL_RCC_SetAPB1Prescaler(__CLK_APB1_DIV__);
        LL_RCC_SetAPB2Prescaler(__CLK_APB2_DIV__);
        LL_RCC_SetAPB3Prescaler(__CLK_APB3_DIV__);
        LL_RCC_SetAPB4Prescaler(__CLK_APB4_DIV__);

        //----------------------------------------------------------------------
        // Clock sources
        //----------------------------------------------------------------------
        LL_RCC_SetSysClkSource(__CLK_SYSCLK_SRC__);
        while (LL_RCC_GetSysClkSource() != __CLK_SYSCLK_SRC_STATUS__);

        LL_RCC_SetUSARTClockSource(__CLK_SRC_UART16__);
        LL_RCC_SetUSARTClockSource(__CLK_SRC_UART234578__);
        LL_RCC_SetLPUARTClockSource(__CLK_SRC_LPUART1__);
        LL_RCC_SetI2CClockSource(__CLK_SRC_I2C123__);
        LL_RCC_SetI2CClockSource(__CLK_SRC_I2C4__);
        LL_RCC_SetLPTIMClockSource(__CLK_SRC_LPTIM1__);
        LL_RCC_SetLPTIMClockSource(__CLK_SRC_LPTIM2__);
        LL_RCC_SetLPTIMClockSource(__CLK_SRC_LPTIM345__);
        LL_RCC_SetCLKPClockSource(__CLK_SRC_CLKP__);
        LL_RCC_SetSPDIFClockSource(__CLK_SRC_SPDIF__);
#if defined(RCC_D2CCIP1R_SAI1SEL)
        LL_RCC_SetSAIClockSource(__CLK_SRC_SAI1__);
#endif
#if defined(SAI3)
        LL_RCC_SetSAIClockSource(__CLK_SRC_SAI23__);
#endif
#if defined(RCC_CDCCIP1R_SAI2ASEL)
        LL_RCC_SetSAIClockSource(__CLK_SRC_SAI2A__);
#endif
#if defined(RCC_CDCCIP1R_SAI2BSEL)
        LL_RCC_SetSAIClockSource(__CLK_SRC_SAI2B__);
#endif
#if defined(SAI4_Block_A)
        LL_RCC_SetSAIClockSource(__CLK_SRC_SAI4A__);
#endif
#if defined(SAI4_Block_B)
        LL_RCC_SetSAIClockSource(__CLK_SRC_SAI4B__);
#endif
        LL_RCC_SetSDMMCClockSource(__CLK_SRC_SDMMC__);
        LL_RCC_SetRNGClockSource(__CLK_SRC_RNG__);
        LL_RCC_SetUSBClockSource(__CLK_SRC_USB__);
        LL_RCC_SetCECClockSource(__CLK_SRC_CEC__);
        LL_RCC_SetDFSDMClockSource(__CLK_SRC_DFSDM1__);
#if defined(DFSDM2_BASE)
        LL_RCC_SetDFSDM2ClockSource(__CLK_SRC_DFSDM2__);
#endif
        LL_RCC_SetFMCClockSource(__CLK_SRC_FMC__);
        LL_RCC_SetQSPIClockSource(__CLK_SRC_QSPI__);
#if defined(OCTOSPI1) || defined(OCTOSPI2)
        LL_RCC_SetOSPIClockSource(__CLK_SRC_OSPI__);
#endif
#if defined(DSI)
        LL_RCC_SetDSIClockSource(__CLK_SRC_DSI__);
#endif
        LL_RCC_SetSPIClockSource(__CLK_SRC_SPI123__);
        LL_RCC_SetSPIClockSource(__CLK_SRC_SPI45__);
        LL_RCC_SetSPIClockSource(__CLK_SRC_SPI6__);
        LL_RCC_SetFDCANClockSource(__CLK_SRC_FDCAN__);
        LL_RCC_SetSWPClockSource(__CLK_SRC_SWP__);
        LL_RCC_SetADCClockSource(__CLK_SRC_ADC__);

        //----------------------------------------------------------------------
        // Update OS clocks
        //----------------------------------------------------------------------
        sys_update_system_clocks();

        finish:
        return err;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(CLK, void *device_handle)
{
        UNUSED_ARG1(device_handle);

