devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
        LL_RCC_DeInit();
        sys_update_system_clocks();

        return ESUCC;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(CLK, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(CLK, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(CLK,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG6(device_handle, src, count, fpos, wrcnt, fattr);
        return ENOTSUP;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(CLK,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG6(device_handle, dst, count, fpos, rdcnt, fattr);
        return ENOTSUP;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(CLK, void *device_handle, int request, void *arg)
{
        UNUSED_ARG1(device_handle);

        int err = EINVAL;

        if (arg) {
                if (request == IOCTL_CLK__GET_CLK_INFO) {
                        CLK_info_t *clkinf = arg;

                        switch (clkinf->iterator) {
                        case 0: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.SYSCLK_Frequency;
                                clkinf->name = "CPUCLK";
                                break;
                        }

                        case 1: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.SYSCLK_Frequency;
                                clkinf->name = "SYSCLK";
                                break;
                        }

                        case 2: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.HCLK_Frequency;
                                clkinf->name = "HCLK";
                                break;
                        }

                        case 3: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK1_Frequency;
                                clkinf->name = "PCLK1";
                                break;
                        }

                        case 4: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK2_Frequency;
                                clkinf->name = "PCLK2";
                                break;
                        }

                        case 5: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK3_Frequency;
                                clkinf->name = "PCLK3";
                                break;
                        }

                        case 6: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK4_Frequency;
                                clkinf->name = "PCLK4";
                                break;
                        }

                        case 7: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL1ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_P_Frequency;
                                clkinf->name    = "PLL1P";
                                break;
                        }

                        case 8: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL1ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_Q_Frequency;
                                clkinf->name    = "PLL1Q";
                                break;
                        }

                        case 9: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL1ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_R_Frequency;
                                clkinf->name    = "PLL1R";
                                break;
                        }

                        case 10: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL2ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_P_Frequency;
                                clkinf->name    = "PLL2P";
                                break;
                        }

                        case 11: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL2ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_Q_Frequency;
                                clkinf->name    = "PLL2Q";
                                break;
                        }

                        case 12: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL2ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_R_Frequency;
                                clkinf->name    = "PLL2R";
                                break;
                        }

