devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
                        case 13: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL3ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_P_Frequency;
                                clkinf->name    = "PLL3P";
                                break;
                        }

                        case 14: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL3ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_Q_Frequency;
                                clkinf->name    = "PLL3Q";
                                break;
                        }

                        case 15: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL3ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_R_Frequency;
                                clkinf->name    = "PLL3R";
                                break;
                        }

                        case 16:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
                                clkinf->name = "USART1";
                                break;

                        case 17:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "USART2";
                                break;

                        case 18:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "USART3";
                                break;

                        case 19:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART4";
                                break;

                        case 20:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART5";
                                break;

                        case 21:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
                                clkinf->name = "USART6";
                                break;

                        case 22:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART7";
                                break;

                        case 23:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART8";
                                break;

                        case 24:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
                                clkinf->name = "UART9";
                                break;

                        case 25:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
                                clkinf->name = "USART10";
                                break;

                        case 26:
                                clkinf->freq_Hz = LL_RCC_GetLPUARTClockFreq(LL_RCC_LPUART1_CLKSOURCE);
                                clkinf->name = "LPUART1";
                                break;

                        case 27:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C123_CLKSOURCE);
                                clkinf->name = "I2C1";
                                break;

                        case 28:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C123_CLKSOURCE);
                                clkinf->name = "I2C2";
                                break;

                        case 29:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C123_CLKSOURCE);
                                clkinf->name = "I2C3";
                                break;

                        case 30:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C4_CLKSOURCE);
                                clkinf->name = "I2C4";
                                break;

                        case 31:
                                clkinf->freq_Hz = LL_RCC_GetI2CClockFreq(LL_RCC_I2C123_CLKSOURCE);
                                clkinf->name = "I2C5";
                                break;

                        case 32:
                                clkinf->freq_Hz = LL_RCC_GetLPTIMClockFreq(LL_RCC_LPTIM1_CLKSOURCE);
                                clkinf->name = "LPTIM1";
                                break;

                        case 33:
                                clkinf->freq_Hz = LL_RCC_GetLPTIMClockFreq(LL_RCC_LPTIM2_CLKSOURCE);
                                clkinf->name = "LPTIM2";
                                break;

                        case 34:
                                clkinf->freq_Hz = LL_RCC_GetLPTIMClockFreq(LL_RCC_LPTIM345_CLKSOURCE);
                                clkinf->name = "LPTIM3";
                                break;

                        case 35:
                                clkinf->freq_Hz = LL_RCC_GetLPTIMClockFreq(LL_RCC_LPTIM345_CLKSOURCE);
                                clkinf->name = "LPTIM4";
                                break;

                        case 36:
                                clkinf->freq_Hz = LL_RCC_GetLPTIMClockFreq(LL_RCC_LPTIM345_CLKSOURCE);
                                clkinf->name = "LPTIM5";
                                break;

                        case 37:
                                clkinf->freq_Hz = LL_RCC_GetADCClockFreq(LL_RCC_ADC_CLKSOURCE);
                                clkinf->name = "ADC";
                                break;

