devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
                        case 38:
                                clkinf->freq_Hz = LL_RCC_GetSDMMCClockFreq(LL_RCC_SDMMC_CLKSOURCE);
                                clkinf->name = "SDMMC";
                                break;

                        case 39:
                                clkinf->freq_Hz = LL_RCC_GetRNGClockFreq(LL_RCC_RNG_CLKSOURCE);
                                clkinf->name = "RNG";
                                break;

                        case 40:
                                clkinf->freq_Hz = LL_RCC_GetCECClockFreq(LL_RCC_CEC_CLKSOURCE);
                                clkinf->name = "CEC";
                                break;

                        case 41:
                                clkinf->freq_Hz = LL_RCC_GetUSBClockFreq(LL_RCC_USB_CLKSOURCE);
                                clkinf->name = "USB";
                                break;

                        case 42:
                                clkinf->freq_Hz = LL_RCC_GetDFSDMClockFreq(LL_RCC_DFSDM1_CLKSOURCE);
                                clkinf->name = "DFSDM1";
                                break;

                        case 43:
                                clkinf->freq_Hz = LL_RCC_GetSPIClockFreq(LL_RCC_SPI123_CLKSOURCE);
                                clkinf->name = "SPI1";
                                break;

                        case 44:
                                clkinf->freq_Hz = LL_RCC_GetSPIClockFreq(LL_RCC_SPI123_CLKSOURCE);
                                clkinf->name = "SPI2";
                                break;

                        case 45:
                                clkinf->freq_Hz = LL_RCC_GetSPIClockFreq(LL_RCC_SPI123_CLKSOURCE);
                                clkinf->name = "SPI3";
                                break;

                        case 46:
                                clkinf->freq_Hz = LL_RCC_GetSPIClockFreq(LL_RCC_SPI45_CLKSOURCE);
                                clkinf->name = "SPI4";
                                break;

                        case 47:
                                clkinf->freq_Hz = LL_RCC_GetSPIClockFreq(LL_RCC_SPI45_CLKSOURCE);
                                clkinf->name = "SPI5";
                                break;

                        case 48:
                                clkinf->freq_Hz = LL_RCC_GetSPIClockFreq(LL_RCC_SPI6_CLKSOURCE);
                                clkinf->name = "SPI6";
                                break;

                        case 49:
                                clkinf->freq_Hz = LL_RCC_GetFMCClockFreq(LL_RCC_FMC_CLKSOURCE);
                                clkinf->name = "FMC";
                                break;

                        default:
                                clkinf->freq_Hz = 0;
                                clkinf->name = NULL;
                                break;
                        }

                        clkinf->iterator++;

                        err = ESUCC;
                } else {
                        err = EBADRQC;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(CLK, void *device_handle)
{
        UNUSED_ARG1(device_handle);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(CLK, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG2(device_handle, device_stat);
        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function get PLL input frequency (the same for PLL1, PLL2, PLL3).
 *
 * @return PLL input frequency.
 */
//==============================================================================
static u32_t get_pll_input_freq(void)
{
        u32_t pllinputfreq = 0;

        switch (LL_RCC_PLL_GetSource()) {
        case LL_RCC_PLLSOURCE_HSI:
                if (LL_RCC_HSI_IsReady() != 0U) {
                        pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_CR_HSIDIV_Pos);
                }
                break;

        case LL_RCC_PLLSOURCE_CSI:
                if (LL_RCC_CSI_IsReady() != 0U) {
                        pllinputfreq = CSI_VALUE;
                }
                break;

        case LL_RCC_PLLSOURCE_HSE:
                if (LL_RCC_HSE_IsReady() != 0U) {
                        pllinputfreq = HSE_VALUE;
                }
                break;
        }

        return pllinputfreq;
}

//==============================================================================
/**
 * @brief  Function return PLL input parameters.
 *
 * @param  pllinputfreq         PLL input frequency
 * @param  pll_input_range      PLL input range
 * @param  pll_output_range     PLL output range
 */
//==============================================================================
static void get_pll_input_parameters(u32_t *pll_input_freq, u32_t *pll_input_range, u32_t *pll_ouput_range)
{
        *pll_input_freq = get_pll_input_freq();

        if (*pll_input_freq >= 8000000) {
                *pll_input_range = LL_RCC_PLLINPUTRANGE_8_16;
                *pll_ouput_range = LL_RCC_PLLVCORANGE_WIDE;
        } else if (*pll_input_freq >= 4000000) {
                *pll_input_range = LL_RCC_PLLINPUTRANGE_4_8;
                *pll_ouput_range = LL_RCC_PLLVCORANGE_WIDE;
        } else if (*pll_input_freq >= 2000000) {
                *pll_input_range = LL_RCC_PLLINPUTRANGE_2_4;
                *pll_ouput_range = LL_RCC_PLLVCORANGE_WIDE;
        } else {
                *pll_input_range = LL_RCC_PLLINPUTRANGE_1_2;
                *pll_ouput_range = LL_RCC_PLLVCORANGE_MEDIUM;
        }
}

//==============================================================================
/**
 * @brief  Function calculate core voltage regulator parameters and flash wait
 *         states according to target frequency.
 *
 * @return One of errno value.
 */
//==============================================================================
static int configure_core_voltage_and_flash_latency(void)
{
        int   err  = 0;

        u32_t hclk = __CLK_HCLK_FREQ__ / 1000000;

