devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
        u32_t FLASH_ACR = FLASH_ACR_WRHIGHFREQ_10 | FLASH_ACR_LATENCY_7WS;
        u32_t VOS = PWR_REGULATOR_VOLTAGE_SCALE3;

        if (hclk <= 45) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE3;
                FLASH_ACR = FLASH_ACR_LATENCY_0WS | FLASH_ACR_WRHIGHFREQ_00;

        } else if (hclk <= 55) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE2;
                FLASH_ACR = FLASH_ACR_LATENCY_0WS | FLASH_ACR_WRHIGHFREQ_00;

        } else if (hclk <= 70) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;
                FLASH_ACR = FLASH_ACR_LATENCY_0WS | FLASH_ACR_WRHIGHFREQ_00;

        } else if ((hclk >= 45) && (hclk <= 90)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE3;
                FLASH_ACR = FLASH_ACR_LATENCY_1WS | FLASH_ACR_WRHIGHFREQ_01;

        } else if ((hclk >= 55) && (hclk <= 110)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE2;
                FLASH_ACR = FLASH_ACR_LATENCY_1WS | FLASH_ACR_WRHIGHFREQ_01;

        } else if ((hclk >= 70) && (hclk <= 140)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;
                FLASH_ACR = FLASH_ACR_LATENCY_1WS | FLASH_ACR_WRHIGHFREQ_01;

        } else if ((hclk >= 90) && (hclk <= 135)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE3;
                FLASH_ACR = FLASH_ACR_LATENCY_2WS | FLASH_ACR_WRHIGHFREQ_01;

        } else if ((hclk >= 110) && (hclk <= 165)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE2;
                FLASH_ACR = FLASH_ACR_LATENCY_2WS | FLASH_ACR_WRHIGHFREQ_01;

        } else if ((hclk >= 135) && (hclk <= 180)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE3;
                FLASH_ACR = FLASH_ACR_LATENCY_3WS | FLASH_ACR_WRHIGHFREQ_10;

        } else if ((hclk >= 140) && (hclk <= 185)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;
                FLASH_ACR = FLASH_ACR_LATENCY_2WS | FLASH_ACR_WRHIGHFREQ_01;

        } else if ((hclk >= 165) && (hclk <= 225)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE2;
                FLASH_ACR = FLASH_ACR_LATENCY_3WS | FLASH_ACR_WRHIGHFREQ_10;

        } else if ((hclk >= 180) && (hclk <= 225)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE3;
                FLASH_ACR = FLASH_ACR_LATENCY_4WS | FLASH_ACR_WRHIGHFREQ_10;

        } else if ((hclk >= 185) && (hclk <= 210)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;
                FLASH_ACR = FLASH_ACR_LATENCY_2WS | FLASH_ACR_WRHIGHFREQ_10;

        } else if ((hclk >= 210) && (hclk <= 225)) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;
                FLASH_ACR = FLASH_ACR_LATENCY_3WS | FLASH_ACR_WRHIGHFREQ_10;

        } else {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE0;
                FLASH_ACR = FLASH_ACR_LATENCY_4WS | FLASH_ACR_WRHIGHFREQ_10;
        }

        // Set the core voltage
        if ((PWR->CSR1 & PWR_CSR1_ACTVOS) != VOS) {
                SET_BIT(PWR->CR3, PWR_CR3_LDOEN);

                u32_t VOS_tmp = (VOS == PWR_REGULATOR_VOLTAGE_SCALE0) ? PWR_REGULATOR_VOLTAGE_SCALE1 : VOS;
                MODIFY_REG(PWR->D3CR, PWR_D3CR_VOS_Msk, VOS_tmp);
                clock_t tref = sys_get_uptime_ms();
                while (not (PWR->D3CR & PWR_D3CR_VOSRDY)) {
                        if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                printk("CLK: VOS1-3 timeout");
                                err = ETIME;
                                break;
                        }

                        sys_sleep_ms(1);
                }

                // Enable core boost voltage
                if (!err && (VOS == PWR_REGULATOR_VOLTAGE_SCALE0)) {
                        SET_BIT(RCC->APB4ENR, RCC_APB4ENR_SYSCFGEN);
                        SET_BIT(SYSCFG->PWRCR, SYSCFG_PWRCR_ODEN);
                        clock_t tref = sys_get_uptime_ms();
                        while (not (PWR->D3CR & PWR_D3CR_VOSRDY)) {
                                if (sys_is_time_expired(tref, TIMEOUT_MS)) {
                                        printk("CLK: VOS0 timeout");
                                        err = ETIME;
                                        break;
                                }

                                sys_sleep_ms(1);
                        }
                }
        }

        // flash latency and programming delay
        if (!err) {
                clock_t tref = sys_get_uptime_ms();
                while (not sys_is_time_expired(tref, TIMEOUT_MS)) {
                        WRITE_REG(FLASH->ACR, FLASH_ACR);
                        if ((FLASH->ACR & FLASH_ACR_LATENCY_Msk) == FLASH_ACR) {
                                break;
                        }
                }
        }

        return err;
}

/*==============================================================================
  End of file
==============================================================================*/
